_posts/2014-08-15-first-post.html
---
layout: post 
title: 第一篇博文 顺致小哥
categories: [感悟, 技术]
tags: [Emacs, org-mode, GitHub, Jekyll, Geek, 小哥]
icon: leaf
---
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">缘起</h2>
<div class="outline-text-2" id="text-1">
<p>
2013年11月17日，当时我在香港，在小哥的忽悠下，注册了被誉为“程序员的Facebook”——GitHub社区的帐号。注册后小哥曾大力推荐我用Github + Jekyll搭建自己的博客，这也是他博客
<a href="http://yangchao.me">小哥的博客</a> 的主要工具。
</p>

<p>
时过境迁，转眼已到了2014年的8月份。从2014年初我就开始折腾Emacs，到现在基本熟悉了Orgmode
的用法，也终于有精力可以折腾点别的。前几天刚配好Emacs+ESS，今天就开始折腾Emacs
Orgmode+Jekyll+Github搭建博客的方法，折腾了一天，总算基本成功了，还要感谢小哥引领我走上 <b>Geek</b> 的道路。
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">致谢</h2>
<div class="outline-text-2" id="text-2">
<p>
本博客模版来自<a href="https://github.com/codepiano/codepiano.github.com">codepiano</a> ，感谢原作者分享的代码。
</p>
</div>
</div>
